; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p6---int100n150-m25---int100c150---s97---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level6 level6)
(sum level0 level11 level11)
(sum level0 level13 level13)
(sum level0 level18 level18)
(sum level0 level19 level19)
(sum level0 level22 level22)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level6 level7)
(sum level1 level11 level12)
(sum level1 level13 level14)
(sum level1 level18 level19)
(sum level1 level19 level20)
(sum level1 level22 level23)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level6 level8)
(sum level2 level11 level13)
(sum level2 level13 level15)
(sum level2 level18 level20)
(sum level2 level19 level21)
(sum level2 level22 level24)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level6 level9)
(sum level3 level11 level14)
(sum level3 level13 level16)
(sum level3 level18 level21)
(sum level3 level19 level22)
(sum level3 level22 level25)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level6 level10)
(sum level4 level11 level15)
(sum level4 level13 level17)
(sum level4 level18 level22)
(sum level4 level19 level23)
(sum level4 level22 level26)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level6 level11)
(sum level5 level11 level16)
(sum level5 level13 level18)
(sum level5 level18 level23)
(sum level5 level19 level24)
(sum level5 level22 level27)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level6 level12)
(sum level6 level11 level17)
(sum level6 level13 level19)
(sum level6 level18 level24)
(sum level6 level19 level25)
(sum level6 level22 level28)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level6 level13)
(sum level7 level11 level18)
(sum level7 level13 level20)
(sum level7 level18 level25)
(sum level7 level19 level26)
(sum level7 level22 level29)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level6 level14)
(sum level8 level11 level19)
(sum level8 level13 level21)
(sum level8 level18 level26)
(sum level8 level19 level27)
(sum level8 level22 level30)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level6 level15)
(sum level9 level11 level20)
(sum level9 level13 level22)
(sum level9 level18 level27)
(sum level9 level19 level28)
(sum level9 level22 level31)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level6 level16)
(sum level10 level11 level21)
(sum level10 level13 level23)
(sum level10 level18 level28)
(sum level10 level19 level29)
(sum level10 level22 level32)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level6 level17)
(sum level11 level11 level22)
(sum level11 level13 level24)
(sum level11 level18 level29)
(sum level11 level19 level30)
(sum level11 level22 level33)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level6 level18)
(sum level12 level11 level23)
(sum level12 level13 level25)
(sum level12 level18 level30)
(sum level12 level19 level31)
(sum level12 level22 level34)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level6 level19)
(sum level13 level11 level24)
(sum level13 level13 level26)
(sum level13 level18 level31)
(sum level13 level19 level32)
(sum level13 level22 level35)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level6 level20)
(sum level14 level11 level25)
(sum level14 level13 level27)
(sum level14 level18 level32)
(sum level14 level19 level33)
(sum level14 level22 level36)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level6 level21)
(sum level15 level11 level26)
(sum level15 level13 level28)
(sum level15 level18 level33)
(sum level15 level19 level34)
(sum level15 level22 level37)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level6 level22)
(sum level16 level11 level27)
(sum level16 level13 level29)
(sum level16 level18 level34)
(sum level16 level19 level35)
(sum level16 level22 level38)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level6 level23)
(sum level17 level11 level28)
(sum level17 level13 level30)
(sum level17 level18 level35)
(sum level17 level19 level36)
(sum level17 level22 level39)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level6 level24)
(sum level18 level11 level29)
(sum level18 level13 level31)
(sum level18 level18 level36)
(sum level18 level19 level37)
(sum level18 level22 level40)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level6 level25)
(sum level19 level11 level30)
(sum level19 level13 level32)
(sum level19 level18 level37)
(sum level19 level19 level38)
(sum level19 level22 level41)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level6 level26)
(sum level20 level11 level31)
(sum level20 level13 level33)
(sum level20 level18 level38)
(sum level20 level19 level39)
(sum level20 level22 level42)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level6 level27)
(sum level21 level11 level32)
(sum level21 level13 level34)
(sum level21 level18 level39)
(sum level21 level19 level40)
(sum level21 level22 level43)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level6 level28)
(sum level22 level11 level33)
(sum level22 level13 level35)
(sum level22 level18 level40)
(sum level22 level19 level41)
(sum level22 level22 level44)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level6 level29)
(sum level23 level11 level34)
(sum level23 level13 level36)
(sum level23 level18 level41)
(sum level23 level19 level42)
(sum level23 level22 level45)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level6 level30)
(sum level24 level11 level35)
(sum level24 level13 level37)
(sum level24 level18 level42)
(sum level24 level19 level43)
(sum level24 level22 level46)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level6 level31)
(sum level25 level11 level36)
(sum level25 level13 level38)
(sum level25 level18 level43)
(sum level25 level19 level44)
(sum level25 level22 level47)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level6 level32)
(sum level26 level11 level37)
(sum level26 level13 level39)
(sum level26 level18 level44)
(sum level26 level19 level45)
(sum level26 level22 level48)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level6 level33)
(sum level27 level11 level38)
(sum level27 level13 level40)
(sum level27 level18 level45)
(sum level27 level19 level46)
(sum level27 level22 level49)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level6 level34)
(sum level28 level11 level39)
(sum level28 level13 level41)
(sum level28 level18 level46)
(sum level28 level19 level47)
(sum level28 level22 level50)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level6 level35)
(sum level29 level11 level40)
(sum level29 level13 level42)
(sum level29 level18 level47)
(sum level29 level19 level48)
(sum level29 level22 level51)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level6 level36)
(sum level30 level11 level41)
(sum level30 level13 level43)
(sum level30 level18 level48)
(sum level30 level19 level49)
(sum level30 level22 level52)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level6 level37)
(sum level31 level11 level42)
(sum level31 level13 level44)
(sum level31 level18 level49)
(sum level31 level19 level50)
(sum level31 level22 level53)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level6 level38)
(sum level32 level11 level43)
(sum level32 level13 level45)
(sum level32 level18 level50)
(sum level32 level19 level51)
(sum level32 level22 level54)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level6 level39)
(sum level33 level11 level44)
(sum level33 level13 level46)
(sum level33 level18 level51)
(sum level33 level19 level52)
(sum level33 level22 level55)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level6 level40)
(sum level34 level11 level45)
(sum level34 level13 level47)
(sum level34 level18 level52)
(sum level34 level19 level53)
(sum level34 level22 level56)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level6 level41)
(sum level35 level11 level46)
(sum level35 level13 level48)
(sum level35 level18 level53)
(sum level35 level19 level54)
(sum level35 level22 level57)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level6 level42)
(sum level36 level11 level47)
(sum level36 level13 level49)
(sum level36 level18 level54)
(sum level36 level19 level55)
(sum level36 level22 level58)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level6 level43)
(sum level37 level11 level48)
(sum level37 level13 level50)
(sum level37 level18 level55)
(sum level37 level19 level56)
(sum level37 level22 level59)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level6 level44)
(sum level38 level11 level49)
(sum level38 level13 level51)
(sum level38 level18 level56)
(sum level38 level19 level57)
(sum level38 level22 level60)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level6 level45)
(sum level39 level11 level50)
(sum level39 level13 level52)
(sum level39 level18 level57)
(sum level39 level19 level58)
(sum level39 level22 level61)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level6 level46)
(sum level40 level11 level51)
(sum level40 level13 level53)
(sum level40 level18 level58)
(sum level40 level19 level59)
(sum level40 level22 level62)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level6 level47)
(sum level41 level11 level52)
(sum level41 level13 level54)
(sum level41 level18 level59)
(sum level41 level19 level60)
(sum level41 level22 level63)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level6 level48)
(sum level42 level11 level53)
(sum level42 level13 level55)
(sum level42 level18 level60)
(sum level42 level19 level61)
(sum level42 level22 level64)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level6 level49)
(sum level43 level11 level54)
(sum level43 level13 level56)
(sum level43 level18 level61)
(sum level43 level19 level62)
(sum level43 level22 level65)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level6 level50)
(sum level44 level11 level55)
(sum level44 level13 level57)
(sum level44 level18 level62)
(sum level44 level19 level63)
(sum level44 level22 level66)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level6 level51)
(sum level45 level11 level56)
(sum level45 level13 level58)
(sum level45 level18 level63)
(sum level45 level19 level64)
(sum level45 level22 level67)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level6 level52)
(sum level46 level11 level57)
(sum level46 level13 level59)
(sum level46 level18 level64)
(sum level46 level19 level65)
(sum level46 level22 level68)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level6 level53)
(sum level47 level11 level58)
(sum level47 level13 level60)
(sum level47 level18 level65)
(sum level47 level19 level66)
(sum level47 level22 level69)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level6 level54)
(sum level48 level11 level59)
(sum level48 level13 level61)
(sum level48 level18 level66)
(sum level48 level19 level67)
(sum level48 level22 level70)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level6 level55)
(sum level49 level11 level60)
(sum level49 level13 level62)
(sum level49 level18 level67)
(sum level49 level19 level68)
(sum level49 level22 level71)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level6 level56)
(sum level50 level11 level61)
(sum level50 level13 level63)
(sum level50 level18 level68)
(sum level50 level19 level69)
(sum level50 level22 level72)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level6 level57)
(sum level51 level11 level62)
(sum level51 level13 level64)
(sum level51 level18 level69)
(sum level51 level19 level70)
(sum level51 level22 level73)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level6 level58)
(sum level52 level11 level63)
(sum level52 level13 level65)
(sum level52 level18 level70)
(sum level52 level19 level71)
(sum level52 level22 level74)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level6 level59)
(sum level53 level11 level64)
(sum level53 level13 level66)
(sum level53 level18 level71)
(sum level53 level19 level72)
(sum level53 level22 level75)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level6 level60)
(sum level54 level11 level65)
(sum level54 level13 level67)
(sum level54 level18 level72)
(sum level54 level19 level73)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level6 level61)
(sum level55 level11 level66)
(sum level55 level13 level68)
(sum level55 level18 level73)
(sum level55 level19 level74)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level6 level62)
(sum level56 level11 level67)
(sum level56 level13 level69)
(sum level56 level18 level74)
(sum level56 level19 level75)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level6 level63)
(sum level57 level11 level68)
(sum level57 level13 level70)
(sum level57 level18 level75)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level6 level64)
(sum level58 level11 level69)
(sum level58 level13 level71)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level6 level65)
(sum level59 level11 level70)
(sum level59 level13 level72)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level6 level66)
(sum level60 level11 level71)
(sum level60 level13 level73)
(sum level61 level1 level62)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level6 level67)
(sum level61 level11 level72)
(sum level61 level13 level74)
(sum level62 level1 level63)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level6 level68)
(sum level62 level11 level73)
(sum level62 level13 level75)
(sum level63 level1 level64)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level63 level6 level69)
(sum level63 level11 level74)
(sum level64 level1 level65)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level64 level6 level70)
(sum level64 level11 level75)
(sum level65 level1 level66)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level65 level6 level71)
(sum level66 level1 level67)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level66 level6 level72)
(sum level67 level1 level68)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level67 level6 level73)
(sum level68 level1 level69)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level68 level6 level74)
(sum level69 level1 level70)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level69 level6 level75)
(sum level70 level1 level71)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level71 level1 level72)
(sum level71 level2 level73)
(sum level71 level3 level74)
(sum level72 level1 level73)
(sum level72 level2 level74)
(sum level72 level3 level75)
(sum level73 level1 level74)
(sum level73 level2 level75)
(sum level74 level1 level75)

(connected l0 l1)
(fuelcost level1 l0 l1)
(connected l0 l2)
(fuelcost level19 l0 l2)
(connected l0 l3)
(fuelcost level2 l0 l3)
(connected l0 l4)
(fuelcost level22 l0 l4)
(connected l1 l0)
(fuelcost level1 l1 l0)
(connected l1 l2)
(fuelcost level13 l1 l2)
(connected l1 l3)
(fuelcost level18 l1 l3)
(connected l1 l5)
(fuelcost level3 l1 l5)
(connected l2 l0)
(fuelcost level19 l2 l0)
(connected l2 l1)
(fuelcost level13 l2 l1)
(connected l3 l0)
(fuelcost level2 l3 l0)
(connected l3 l1)
(fuelcost level18 l3 l1)
(connected l3 l5)
(fuelcost level11 l3 l5)
(connected l4 l0)
(fuelcost level22 l4 l0)
(connected l4 l5)
(fuelcost level6 l4 l5)
(connected l5 l1)
(fuelcost level3 l5 l1)
(connected l5 l3)
(fuelcost level11 l5 l3)
(connected l5 l4)
(fuelcost level6 l5 l4)

(at t0 l3)
(fuel t0 level75)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l1)
(at p3 l2)
(at p4 l2)
(at p5 l4)
)

(:goal
(and
(at p0 l3)
(at p1 l3)
(at p2 l5)
(at p3 l0)
(at p4 l4)
(at p5 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l3 l0 level73 level2 level75)
   deleted: (at t0 l3) (fuel t0 level75)
   added: (at t0 l0) (fuel t0 level73)
   goals met: 0 of 6
2. (drive t0 l0 l2 level54 level19 level73)
   deleted: (at t0 l0) (fuel t0 level73)
   added: (at t0 l2) (fuel t0 level54)
   goals met: 0 of 6
3. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 6
4. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 6
5. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 6
6. (drive t0 l2 l1 level41 level13 level54)
   deleted: (at t0 l2) (fuel t0 level54)
   added: (at t0 l1) (fuel t0 level41)
   goals met: 0 of 6
7. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 6
8. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 6
9. (drive t0 l1 l5 level38 level3 level41)
   deleted: (at t0 l1) (fuel t0 level41)
   added: (at t0 l5) (fuel t0 level38)
   goals met: 0 of 6
10. (unload p2 t0 l5)
   deleted: (in p2 t0)
   added: (at p2 l5)
   goals met: 1 of 6
11. (drive t0 l5 l4 level32 level6 level38)
   deleted: (at t0 l5) (fuel t0 level38)
   added: (at t0 l4) (fuel t0 level32)
   goals met: 1 of 6
12. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 1 of 6
13. (unload p4 t0 l4)
   deleted: (in p4 t0)
   added: (at p4 l4)
   goals met: 2 of 6
14. (drive t0 l4 l0 level10 level22 level32)
   deleted: (at t0 l4) (fuel t0 level32)
   added: (at t0 l0) (fuel t0 level10)
   goals met: 2 of 6
15. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 3 of 6
16. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 4 of 6
17. (drive t0 l0 l3 level8 level2 level10)
   deleted: (at t0 l0) (fuel t0 level10)
   added: (at t0 l3) (fuel t0 level8)
   goals met: 4 of 6
18. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 5 of 6
19. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 6 of 6
